{
  "backend/main.mo": "Motoko actor defining the backend for AI SkillBridge, managing session-based mentor response storage, merge conflict records, and industry challenges (CRUD) using in-memory maps.",
  "feature_evidence.json": "Feature evidence report mapping each product feature (dashboard, data structure visualizer, AI mentor panel, git conflict simulator, etc.) to their implementing frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON file containing short summaries of two frontend pages: ChallengeWorkspace (challenge fetch/answer editor) and MyNotes (localStorage-backed AI mentor response history).",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme tokens (colors, radius, chart colors, sidebar) used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'AI SkillBridge', mounting the app at the #root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for Dashboard, DataStructureVisualizer, GitConflictSimulator, IndustryChallengeFeed, ChallengeWorkspace, and MyNotes, all wrapped in a shared Layout.",
  "frontend/src/components/AIMentorPanel.tsx": "Interactive AI Mentor chat panel that matches user queries against a keyword-based knowledge base to return structured mentor responses (approach, trade-offs, analogy, alternative) and persists them to the backend per session.",
  "frontend/src/components/AlgorithmVisualizer.tsx": "Canvas-based algorithm visualizer component that renders animated step-by-step traversal for BST, flat array, hashmap, and linked list data structures, highlighting visited and current nodes/elements.",
  "frontend/src/components/AnswerEditor.tsx": "Simple styled textarea component styled as a code editor (with macOS-style traffic-light dots) for writing free-form markdown answers to challenges.",
  "frontend/src/components/ChallengeCard.tsx": "Renders a clickable card for a coding challenge, displaying its category, difficulty badge, title, description preview, and estimated time derived from the challenge data.",
  "frontend/src/components/ComparisonPanel.tsx": "Displays a side-by-side animated comparison of two data structures (BST, Array, HashMap, LinkedList), showing Big-O complexities, industry context tooltips, and step-through visualization driven by an interval timer.",
  "frontend/src/components/DiffPanel.tsx": "Renders a three-way diff view (BASE, OURS, THEIRS) with syntax-highlighted added/removed lines and line numbers in a side-by-side layout.",
  "frontend/src/components/Layout.tsx": "Provides the main app shell with a sticky header, desktop and mobile navigation, an AI Mentor panel toggle, and a persistent session ID stored in localStorage.",
  "frontend/src/components/MentorResponseCard.tsx": "Displays a structured AI mentor response broken into four labeled sections (Approach, Trade-offs, Real-world Analogy, Better Alternative), each with a distinct icon and color.",
  "frontend/src/components/MergedOutputEditor.tsx": "A simple textarea editor for resolving Git merge conflicts, prompting the user to remove conflict markers from the merged output.",
  "frontend/src/components/ModuleCard.tsx": "Renders a navigable card for a learning module, showing an icon, title, description, progress bar, and an animated SVG progress ring.",
  "frontend/src/components/ProgressRing.tsx": "An SVG circular progress indicator that animates from 0 to the given percentage on mount, supporting green, cyan, and purple color themes with a glow effect.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, returning an anonymous actor when unauthenticated and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data, including getting all/single challenges, adding a challenge, and storing mentor responses via the actor.",
  "frontend/src/index.css": "Global stylesheet that sets up a dark tech-themed design system using Tailwind CSS with OKLCH color tokens, neon accent utilities, custom component classes, and JetBrains Mono/Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the root DOM element.",
  "frontend/src/pages/ChallengeWorkspace.tsx": "Page component for a single challenge workspace that loads a challenge by ID, displays its description and metadata, and provides an answer editor with local-storage persistence and submission handling.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying a hero banner, stats row, and a grid of module cards linking to the app's four learning modules.",
  "frontend/src/pages/DataStructureVisualizer.tsx": "Interactive page that lets users select two data structures and run a side-by-side animated comparison using a fixed dataset, with play/reset controls and a completion state.",
  "frontend/src/pages/GitConflictSimulator.tsx": "Interactive Git merge conflict simulator page with multiple predefined scenarios (variable rename, logic divergence, etc.), a split diff editor, merged output editor, hint system, and validation against expected resolutions.",
  "frontend/src/pages/IndustryChallengeFeed.tsx": "Page displaying a filterable/searchable feed of industry challenge cards (system design, algorithms, DevOps, etc.) fetched from the backend, with auto-seeding of default challenges if the backend is empty.",
  "frontend/src/pages/MyNotes.tsx": "Page that displays saved AI Mentor responses stored in localStorage, allowing users to expand, delete individual notes, or clear all notes for the current session.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark-tech theme with neon color tokens (neon-green, neon-cyan, neon-purple), custom surface layers, JetBrains Mono font, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing the AI-powered CS education platform's architecture, existing features, known issues, and image asset requirements at schema version 1.0.0."
}